# CreateSurfaceGeometryInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGeometryInfo..::..CreateSurfaceGeometryInfo Method
IFCGeometryInfo Class See Also
---
Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static IFCGeometryInfo CreateSurfaceGeometryInfo(
	double epsilon
)
```

Visual Basic
---
```text
Public Shared Function CreateSurfaceGeometryInfo ( _
	epsilon As Double _
) As IFCGeometryInfo
```

Visual C++
---
```text
public:
static IFCGeometryInfo^ CreateSurfaceGeometryInfo(
	double epsilon
)
```

# ### Parameters
epsilon
    Type: System..::..Double The epsilon value used to process surfaces.
# ### Return Value
The new geometry info container.
# See Also
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace